const armorArr = [["か","カムラノ装・継"],["れ","レザーX"],["ち","チェーンX"],["は","ハンターX"],["ら","ランポス"],["ざ","ザザミ"],["ば","バギィX"],["ふ","フロギィX"],["く","クルルX"],["ぷ","プケプケX"],["う","ウルクX"],["じ","ジャナフX"],["あ","アケノX"],["て","テンゴZ"],["る","ルドロスX"],["よ","ヨツミX"],["い","インゴットX"],["ぶ","ブナハX"],["い","イズチX"],["ず","ズワロX"],["れ","レイアX"],["か","カガチX"],["す","スカルX"],["ど","ドーベルX"],["う","ヴァイクX"],["で","デスギアX"],["べ","ベリオX"],["ご","ゴルム"],["ぎ","ギザミ"],["が","ガブラスX"],["じ","ジンオウX"],["る","ルナガロ"],["な","ナルガX"],["ふ","ファンゴXフェイク"],["ぜ","ゼクス"],["れ","レギオス"],["い","イソネX"],["い","イソネZ"],["ま","禍鎧・真"],["く","クロムメタルX"],["み","ミツネX"],["ぼ","ボロスX"],["や","ヤツカダX"],["て","テンゴX"],["あ","アシラX"],["あ","アルブーロX"],["あ","アロイX"],["う","ウツシ裏・真"],["う","ウツシ表・真"],["え","エーデルX"],["え","エコール"],["え","エスピナ"],["お","王国軽装騎士"],["お","王国重装騎士"],["お","王国砲術隊"],["お","オロミドX"],["お","オロミドZ"],["が","ガーグァXフェイク"],["が","ガーディアン"],["か","神凪・洸"],["ぎ","ギルドバード"],["く","狗竜の革X"],["ぐ","グローシア"],["ご","ゴア"],["ご","ゴギョウ"],["ご","ゴシャX"],["こ","コトルX"],["こ","混沌・真"],["じ","ジャギィXフェイク"],["じ","ジュラX"],["す","スカラー"],["す","スカルダX"],["す","スパイオX"],["た","タロス"],["で","ディアブロX"],["で","ディグニ"],["ど","ドロスX"],["ば","バサルX"],["ば","バルバニア"],["ふ","ファルメルX"],["ぶ","ブリゲイドX"],["ふ","フルフルX"],["ほ","ホーク"],["ぼ","ボーンX"],["ま","マカルパX"],["ま","マギュルX"],["め","メルゼ"],["め","メルホアX"],["や","ヤツカダZ"],["ゆ","ユクモノ"],["よ","依巫・燿"],["ら","ラングロX"],["ら","ランゴ"],["り","リノプロX"],["れ","レウスX"],["れ","レックスX"],["ろ","ロワーガX"],["だ","ダマスクX"],["せ","斉天・真"],["ば","バゼルX"],["み","ミヅハ真"],["あ","アーク"],["し","冥淵纏鎧"],["か","カイザーX"],["く","クシャナX"],["し","祝福の羽根飾り"],["か","翔駆の羽根飾り"],["ふ","フィリア"],["さ","サージュ"],["し","シーカー"],["せ","セイラー"],["し","しまき・真"],["な","なるかみ・真"],["ど","怒天"],["か","赫耀・真"],["お","王国拠点司令"],["し","シャリテ"],["ま","禍鎧・怨"],["ぎ","ギルドパレス"],["ぷ","プロフ"],["め","メデュレトX"],["ぷ","プライド"],["し","シルバーソル"],["ご","ゴールドルナ"],["げ","月光"]];
const skillArr = [["あ","アイテム使用強化"],["お","鬼火纏"],["が","ガード性能"],["か","会心撃【属性】"],["か","回避距離UP"],["か","回避性能"],["か","回復速度"],["か","翔蟲使い"],["か","火事場力"],["か","滑走強化"],["か","雷属性攻撃強化"],["か","雷耐性"],["か","貫通弾・貫通矢強化"],["き","気絶耐性"],["き","キノコ大好き"],["ぎ","逆襲"],["き","強化持続"],["け","KO術"],["こ","広域化"],["こ","攻撃"],["こ","高速変形"],["こ","氷属性攻撃強化"],["こ","氷耐性"],["こ","渾身"],["さ","逆恨み"],["さ","散弾・拡散矢強化"],["じ","ジャンプ鉄人"],["し","集中"],["し","植生学"],["す","睡眠属性強化"],["す","睡眠耐性"],["す","スタミナ急速回復"],["す","スタミナ奪取"],["せ","精霊の加護"],["せ","攻めの守勢"],["そ","装填拡張"],["そ","装填速度"],["ぞ","属性やられ耐性"],["た","体術"],["た","耐震"],["た","体力回復量UP"],["だ","弾丸節約"],["だ","弾導強化"],["ち","力の解放"],["ち","地質学"],["ち","挑戦者"],["つ","通常弾・連射矢強化"],["と","砥石使用高速化"],["と","特殊射撃強化"],["ど","毒属性強化"],["ど","毒耐性"],["と","飛び込み"],["ど","泥雪耐性"],["ど","鈍器使い"],["の","納刀術"],["の","乗り名人"],["は","破壊王"],["は","剥ぎ取り鉄人"],["ば","爆破属性強化"],["ば","爆破やられ耐性"],["ば","抜刀術【力】"],["ば","抜刀術【技】"],["は","早食い"],["は","腹減り耐性"],["は","反動軽減"],["ひ","火属性攻撃強化"],["ひ","火耐性"],["ふ","風圧耐性"],["ふ","笛吹き名人"],["ふ","不屈"],["ふ","フルチャージ"],["ぶ","ブレ抑制"],["へ","壁面移動"],["ぼ","防御"],["ほ","砲術"],["ほ","砲弾装填"],["う","泡沫の舞"],["ぼ","ボマー"],["ま","麻痺属性強化"],["ま","麻痺耐性"],["ま","満足感"],["み","見切り"],["み","水属性攻撃強化"],["み","水耐性"],["み","耳栓"],["よ","陽動"],["ら","ランナー"],["り","龍属性攻撃強化"],["り","龍耐性"],["わ","業物"],["し","死中に活"],["ち","超会心"],["じ","弱点特効"],["た","匠"],["ご","剛刃研磨"],["し","心眼"],["が","ガード強化"],["こ","幸運"],["ひ","ひるみ軽減"],["ふ","風紋の一致"],["ら","雷紋の一致"],["ゆ","弓溜め段階解放"],["ほ","捕獲名人"],["そ","速射強化"],["か","霞皮の恩恵"],["こ","鋼殻の恩恵"],["た","達人芸"],["え","炎鱗の恩恵"],["は","剥ぎ取り名人"],["り","龍気活性"],["ふ","風雷合一"],["ち","チューンアップ"],["け","研磨術【鋭】"],["あ","合気"],["れ","連撃"],["じ","刃鱗磨き"],["へ","壁面移動【翔】"],["ち","チャージマスター"],["け","血氣"],["こ","攻勢"],["さ","災禍転福"],["き","供応"],["は","疾之息吹"],["き","狂竜症【蝕】"],["ふ","伏魔響命"],["げ","激昂"],["わ","業鎧【修羅】"],["こ","根性"],["じ","弱点特効【属性】"],["じ","状態異常確定蓄積"],["け","顕如盤石"],["や","闇討ち"],["こ","巧撃"]];
function onExecBtnClick(inputId,optId,arrName) {
	removeOpt(optId);
	var inputId = "#" + inputId;
	if($(inputId).val().length === 0){
		return;
	}
	 	let selectFoodName = document.getElementById(optId);
	 	let tempArr = Array.from(arrName);
	 	for (i = 0; i < tempArr.length; i++) {
			let temp = Array.from(tempArr[i]);
			if(temp[0] == $(inputId).val()){
				let armorOpt = document.createElement('option');
				armorOpt.value = temp[1];
				armorOpt.textContent = temp[1];
				selectFoodName.appendChild(armorOpt)
			}
	}
}

function removeOpt(id){
	sl = document.getElementById(id);
	while(sl.lastChild){
		sl.removeChild(sl.lastChild);
	}
}

function onResultExecBtnClick(){
	let resultStr = 
		getVal("armorOpt") + "," +
		getVal("part") + "," +

		getSkillVal("1") + "," +
		
		getSkillVal("2") + "," +
		getSkillVal("3") + "," +
		getVal("slotOpt1") + "," +
		getVal("slotOpt2") + "," +
		getVal("slotOpt3") + "," +
		getMarkAndVal("defenseLevel1") + "," +
		getMarkAndVal("defenseLevel2") + "," +
		getMarkAndVal("defenseLevel3") + "," +
		getMarkAndVal("defenseLevel4") + "," +
		getMarkAndVal("defenseLevel5") + "," +
		getMarkAndVal("defenseLevel6") + "," +
		getSkillVal("4");

	return $("#result").prop("value",resultStr);
}

function getSkillVal(number){
	let skillOptId = "skillOpt" + number;
	let skillLevel = "skillLevel" + number;

	if(getVal(skillOptId) ==''){
		return "," + getMarkAndVal(skillLevel);
	}


	return getVal(skillOptId, getVal(skillLevel) == 0) + "," + getMarkAndVal(skillLevel);

}

function getMarkAndVal(name){
	if(getVal(name) == 0){
		return 0;
	}

	let selector = 'input[name="' + name + '"]:checked';
	let mark = ''
	if($(selector).val() == "-"){
		mark = $(selector).val();
	}
	return mark + getVal(name); 
}

function getVal(id){
	getVal(id, false);
}

function getVal(id, coercion){
	if(coercion){
		return '';
	}

	let tempId = "#" + id;
	let tempVal = $(tempId).val();
	if(tempVal == null
		|| tempVal == undefined
		|| tempVal.length === 0){
		return '';
	}else{
		return tempVal;
	}
}


// $("#armorName").prop("value","あ");
// $("#skillName1").prop("value","さ");
// $("#skillName2").prop("value","た");
// $("#skillName3").prop("value","き");
// $("#skillName4").prop("value","ち");


